//Определение номера области, в которую попадает точка с произвольно заданными
//координатами на плоскости, и площади этой области

#include<iostream>
#include<math.h>
#include<locale.h>

using namespace std ;

int main()
    {
     
    int i = 0 ;			//номер области на рисунке
    float x, y,			//координаты точки
    s1, s2, s3, s4, s5 ;		//площади областей
     
    setlocale(LC_ALL,"Russian") ;
     
    cout << "\nВведите координаты точки: x, y " ;
    cin >> x >> y ;
     
    if((x - 1) * (x - 1) + y * y > 1 && (x - 1) * (x - 1) + y * y > 1 &&
       (x - 1) * (x - 1) + (y - 1) * (y - 1) < 1 )
     
          {
            cout << "Точка в области M1. " ; i = 1 ;
        }
     
    else if((y - 1) * (y - 1) + x * x > 1 && x * x + y * y > 1 && 
            (x + 1) * (x + 1) + (y - 1) * (y - 1) < 1 && 
            (x + 1) * (x + 1) + y * y < 1)
          
          {
            cout << "Точка в области М2. " ; i = 2 ;
        }
    
    else if((x * x) + y * y < 1 && (x + 1) * (x + 1) + y * y > 1 &&
            (x - 1) * (x - 1) + (y - 1) * (y - 1) > 1 &&
            (x * x) + (y - 1) * (y - 1) < 1 )
    	      
    	  {
    	    cout << "Точка в области М3. " ; i = 3 ;
    	}
    
    else if((x * x) + y * y < 1 && (x - 1) * (x - 1) + y * y < 1 &&
    	    (x - 1) * (x - 1) + (y + 1) * (y + 1) < 1 && 
    	    (x * x) + (y + 1) * (y + 1) < 1)
    	  
    	  {
    		cout << "Точка в области М4. " ; i = 4 ;
        }
    
    else if( (y < -1) && (x - 1) * (x - 1) + (y + 1) * (y + 1) > 1 && 
    	    (x - 1) * (x - 1) + (y + 1) * (y + 1) > 1 &&
    	    (x * x) + (y + 1) * (y + 1) < 1)
    		     
    	  {
    		 cout << "Точка в области М5. " ; i = 5 ;
    	}
    
    else cout << "Точка вне выделенных областей" ;
     
     
    cout.precision(4);		//число знаков после дес. точки
    switch(i)
        
        {
            case 1: cout << "S1 = " << (s1 = M_PI / 4 + 0,3424) ;
        	        break ;
             
            case 2: cout << "S2 = " << (s2 = 1 - sqrt(3)/2 + M_PI / 6) ;
        	        break ;      
        	
        	case 3: cout << "S3 = " << (s3 = sqrt(3)/2 - M_PI/6) ;
        	        break ;
            
             case 4: cout << "S4 = " << (s4 =  M_PI/3 + 1 - sqrt(3)) ;
        	        break ;
            
             case 5: cout << "S5 = " << (s5 = sqrt(3)/2 - M_PI / 6) ;
        }
     
     cout << "\n Повторить-1, Выход-2: " ;
     
     cin >> i ;
     
     if (i == 1) main() ;
    
    return 0 ;
}

 
